In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import random

import statsmodels.api as sm
import statsmodels.formula.api as smf
from statsmodels.formula.api import ols

import datetime
from datetime import datetime, timedelta

import scipy.stats

# import pandas_profiling
# from pandas_profiling import ProfileReport


%matplotlib inline
#sets the default autosave frequency in seconds
%autosave 60 
sns.set_style('dark')
sns.set(font_scale=1.2)

plt.rc('axes', titlesize=9)
plt.rc('axes', labelsize=14)
plt.rc('xtick', labelsize=12)
plt.rc('ytick', labelsize=12)

import warnings
warnings.filterwarnings('ignore')

#Webscraping
#import requests
#from bs4 import BeautifulSoup

# Use Folium library to plot values on a map.
#import folium

# Use Feature-Engine library
#import feature_engine
#import feature_engine.missing_data_imputers as mdi
#from feature_engine.outlier_removers import Winsorizer
#from feature_engine import categorical_encoders as ce
#from feature_engine.discretisation import EqualWidthDiscretiser, EqualFrequencyDiscretiser, DecisionTreeDiscretiser
#from feature_engine.encoding import OrdinalEncoder

pd.set_option('display.max_columns',None)
#pd.set_option('display.max_rows',None)
pd.set_option('display.width', 1000)
pd.set_option('display.float_format','{:.2f}'.format)

random.seed(0)
np.random.seed(0)
np.set_printoptions(suppress=True)

Autosaving every 60 seconds

## Exploratory Data Analysis

In [2]:
df = pd.read_csv("shiny.csv")

In [3]:
df

       age workclass     education     sex  hours_per_week native_country income
0       90       NaN       HS-grad  Female           40.00  United-States  <=50K
1       82   Private       HS-grad  Female           18.00  United-States  <=50K
2       66       NaN  Some-college  Female           40.00  United-States  <=50K
3       54   Private       7th-8th  Female           40.00  United-States  <=50K
4       41   Private  Some-college  Female           40.00  United-States  <=50K
...    ...       ...           ...     ...             ...            ...    ...
32556   22   Private  Some-college    Male           40.00  United-States  <=50K
32557   27   Private    Assoc-acdm  Female           38.00  United-States  <=50K
32558   40   Private       HS-grad    Male           40.00  United-States   >50K
32559   58   Private       HS-grad  Female           40.00  United-States  <=50K
32560   22   Private       HS-grad    Male           20.00  United-States  <=50K

[32561 rows x 7 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       30725 non-null  object
 2   education       32561 non-null  object
 3   sex             32561 non-null  object
 4   hours_per_week  32103 non-null  float64
 5   native_country  31978 non-null  object
 6   income          32561 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 1.7+ MB

In [5]:
df.describe()

           age  hours_per_week
count 32561.00        32103.00
mean     38.58           40.93
std      13.64           11.71
min      17.00           10.00
25%      28.00           40.00
50%      37.00           40.00
75%      48.00           45.00
max      90.00           99.00

In [6]:
df.columns

Index(['age', 'workclass', 'education', 'sex', 'hours_per_week', 'native_country', 'income'], dtype='object')

## Data Preprocessing

### Treat Missing Values

In [7]:
df.isnull().sum()

age                  0
workclass         1836
education            0
sex                  0
hours_per_week     458
native_country     583
income               0
dtype: int64

In [8]:
df.dropna(inplace=True)

In [9]:
df.isnull().sum()

age               0
workclass         0
education         0
sex               0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [11]:
df.reset_index(inplace=True, drop=True)

In [12]:
df

       age workclass     education     sex  hours_per_week native_country income
0       82   Private       HS-grad  Female           18.00  United-States  <=50K
1       54   Private       7th-8th  Female           40.00  United-States  <=50K
2       41   Private  Some-college  Female           40.00  United-States  <=50K
3       34   Private       HS-grad  Female           45.00  United-States  <=50K
4       38   Private          10th    Male           40.00  United-States  <=50K
...    ...       ...           ...     ...             ...            ...    ...
29874   22   Private  Some-college    Male           40.00  United-States  <=50K
29875   27   Private    Assoc-acdm  Female           38.00  United-States  <=50K
29876   40   Private       HS-grad    Male           40.00  United-States   >50K
29877   58   Private       HS-grad  Female           40.00  United-States  <=50K
29878   22   Private       HS-grad    Male           20.00  United-States  <=50K

[29879 rows x 7 columns]

### Save to CSV

In [13]:
#df.to_csv("shiny.csv", index=False)

#### Python code done by Dennis Lam